# 3) Есть список мобильных номеров (должны быть введены вручную).
# Нужно отсортировать их в порядке возрастания и вывести
# в следующем ввиде:
# +91 ххххх ххххх
# Введенные мобильные номера могут начинаться с +91, 91 или 0 перед 10-ти значным номер.
# Или вообще могут быть указаны без префикса.
# Пример ввода:
# 07895462130
# 919875641230
# 9195969878
# Результат
# +91 78954 62130
# +91 91959 69878
# +91 98756 41230
# Подсказка - функция должна парсить и сортировать номера, декоратор - выводить на экран в
# указанном формате
