# 15. По ссылке https://data.cityofchicago.org/api/views/4ijn-s7e5/rows.csv скачать файл с данными о проведении
# различных инспекций заведений общественного питания в Чикаго с 2010 года.
# Загрузить и проанализировать структуру файла и записей в нем.
# * Определить ТОП 10 возможных результатов инспекций (поле `Results`)
# * Создать словарь содержащий все записи для каждого вида инспекций
# * Найти названия (поле `DBA Name`) ТОП-20 самых плохих заведений (результат инспекции - `Fail`)
# * Определить ТОП-15 худших адресов по гоам с 2013 по 2017 (адреса заведений, результат проверки которых - `Fail`,
# а дата проведения инспекции - `Inspection Date` - в диапазоне 20143 - 2017)
