# 2. У нас есть оценки за некоторый промежуток времени у школьников:
# Мария: русский - 4, 3, 4; математика - 5, 4, 4; физика - 5, 5, 4;
# Павел: русский - 3, 3, 3; математика - 3, 4, 5, 3; физика - 5, 3, 4;
# Алексей: русский - 4, 5, 5, 5; математика - 5, 5, 4; физика - 5, 5, 4, 5;
# Ксения: русский - 4, 4, 4; математика - 3, 4, 4, 3; физика - 4, 4, 4;
# Нужно создать словарь из этих данных, вычислить средние оценки по предметам для каждого ученика.
# Добавить нового ученика: Дарья: русский - 4, математика - 5, физика - 3, 4.
# Найти всех учеников, у кого средняя оценка по математике выше 4.5.
